<script setup lang="ts">
const items=[
  { label: 'Главная', route: '/' },
  { label: 'О нас' },
]
const goods = [
  {title:'Древесные сорта пиломатериалов',text:'Лиственница, сосна/ель, ангарская сосна, дуб, ольха, липа, абаш, кедр.'},
  {title:'Виды пиломатериалов',text:'Американка, вагонка штиль, имитация бруса, мебельный щит, наличники, обрезная доска, обрезной брус, палубная доска, планкен, плинтус, половая доска, раскладка, террасная доска и уголок.'},
  {title:'Набор масел',text:'Набор масел, красок и воска для обработки погонажных древесных изделий.'},
  {title:'Большой выбор крепежей',text:'в который вошли: гвозди, дюбеля с очень широким спектром выборочной линейки, саморезы/шурупы и крепежи трёх разнообразных видов.'},
  {title:'Металлопрокат',text:'Металлопрокат, в котором есть: арматура, вязальная проволка, катанка, труба профильная.'},
  {title:'Больше чем каталог',text:'И не смотря на обширность выбора в строительном каталоге нашего интернет-магазина, мы сделаем ещё шире выбор благодаря Вашим личным пожеланиям.'}
]

</script>

<template>
  <div class="container">
    <Breadcrumbs :items="items" />
    <h1 class="text-2xl  font-bold mb-4">О нас</h1>
    <div class="grid grid-cols-1 md:grid-cols-2 gap-4 items-center mb-20">
      <div class="">
        <p class="text-3xl font-semibold mb-10">«VSMPROM» – о компании строительных материалов, которая всегда рада взаимодействию с вами.</p>
        "VSMProm" - компания, предлагающая высококачественные пиломатериалы от производителя по доступным ценам. Мы гарантируем соответствие ГОСТу, точность геометрии и заявленных характеристик. Соблюдение норм хранения обеспечивает безопасность продукции.<br><br>
        Мы постоянно расширяем ассортимент и спектр услуг. Долгосрочное сотрудничество с множеством строительных компаний подтверждает нашу надежность, оперативность и качество продукции даже при выполнении крупных заказов. Наша репутация безупречна уже более 7 лет.
      </div>
      <div class="">
        <img src="~assets/about.png" alt="">
      </div>
    </div>
    <h3 class="text-2xl  font-bold mb-10">Наши товары</h3>
    <p class="mb-10">Товарный ряд нашей компании, который поможет Вам успешно выполнить строительство нужного объекта:</p>
    <div class="grid grid-cols-1 md:grid-cols-3 gap-4">
      <div class="border rounded-[20px] p-10" v-for="(item,index) in goods" :key="index">
        <p class="font-semibold text-lg mb-10">{{item.title}}</p>
        <p class="opacity-60">{{item.text}}</p>
      </div>
    </div>
  </div>
</template>

<style scoped>

</style>