<script setup lang="ts">
const items=[
  { label: 'Главная', route: '/' },
  { label: 'Контакты' },
]
</script>

<template>
  <div class="container">
    <Breadcrumbs :items="items" />
    <h1 class="text-2xl  font-bold mb-4">Доставка и оплата</h1>
    <div class="grid grid-cols-1 md:grid-cols-2 gap-4">
      <div class="border rounded-[20px] p-10">
        <p class="font-semibold text-lg mb-10">Доставка</p>
        <p class="opacity-60">
          Вы сможете получить ваш товар различными способами доставки:<br><br>

          - бесплатный самовывоз с одного из наших складов (они все находятся в пределах 2км от МКАД)<br>
          - доставка нашим транспортом в пределах Москвы и МО<br>
          - доставка любой транспортной кампанией на ваш выбор<br><br>

          Для уточнения деталей и стоимости доставки вы можете связаться с нами по указанным контактам, или же мы сами с вами свяжемся после оформления вами заказа на нашем сайте!
        </p>

      </div>
      <div class="border rounded-[20px] p-10">
        <p class="font-semibold text-lg mb-10">Оплата</p>
        <p class="opacity-60">
          Мы предлагаем произвести оплату удобным для вас образом:<br><br>

          - наличными нашему водителю после доставки;<br>
          - онлайн с помощью банковской карты;<br>
          - СБП;<br>
          - безналичным способом (для юр. лиц)<br><br>

          Мы работаем как по предоплате, так и по постоплате: все зависит от конкретных позиций в заказе!
        </p>

      </div>

    </div>
  </div>
</template>

<style scoped>

</style>