<script setup lang="ts">
const {$api} = useNuxtApp()

const faq = ref([])

onBeforeMount(async () => {
  faq.value = await $api('/api/data/faq')
})
</script>

<template>

  <section class="mb-10 md:mb-20">
    <div class="container">
      <div class="bg-[url(/offer_bg.jpg)] h-[400px] md:h-[630px] text-white px-16 py-24 ">
        <div class="flex flex-col items-start justify-between h-full ">
         <div class="">
           <p class="w-full md:w-4/5 font-semibold md:leading-[85px] text-4xl md:text-6xl  mb-4">Качественные пиломатериалы из лиственницы</p>
           <div class="hidden md:flex gap-3 ">
             <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2  text-white">
               <svg width="14" height="19" viewBox="0 0 14 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                 <path d="M11.1668 12.7042V18.4304C11.1668 18.6605 10.9802 18.8472 10.7502 18.8472C10.6747 18.8472 10.6006 18.8266 10.5358 18.7878L7.00016 16.6663L3.46454 18.7878C3.26721 18.9061 3.01127 18.8421 2.89287 18.6448C2.85402 18.58 2.8335 18.5059 2.8335 18.4304V12.7042C1.30939 11.4824 0.333496 9.60501 0.333496 7.49967C0.333496 3.81777 3.31826 0.833008 7.00016 0.833008C10.6821 0.833008 13.6668 3.81777 13.6668 7.49967C13.6668 9.60501 12.6909 11.4824 11.1668 12.7042ZM7.00016 12.4997C9.76158 12.4997 12.0002 10.2611 12.0002 7.49967C12.0002 4.73825 9.76158 2.49967 7.00016 2.49967C4.23874 2.49967 2.00016 4.73825 2.00016 7.49967C2.00016 10.2611 4.23874 12.4997 7.00016 12.4997ZM7.00016 10.833C5.15921 10.833 3.66683 9.34059 3.66683 7.49967C3.66683 5.65872 5.15921 4.16634 7.00016 4.16634C8.84108 4.16634 10.3335 5.65872 10.3335 7.49967C10.3335 9.34059 8.84108 10.833 7.00016 10.833Z" fill="white"/>
               </svg>
               10 лет ГАрантии
             </p>
             <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2  text-white">
               <svg width="15" height="11" viewBox="0 0 15 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                 <path d="M5.33309 8.64274L12.9934 0.982422L14.1719 2.16093L5.33309 10.9997L0.0297852 5.69649L1.2083 4.51799L5.33309 8.64274Z" fill="white"/>
               </svg>

               20 лет на рынке
             </p>
             <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2  text-white">
               <svg width="15" height="11" viewBox="0 0 15 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                 <path d="M5.33309 8.64274L12.9934 0.982422L14.1719 2.16093L5.33309 10.9997L0.0297852 5.69649L1.2083 4.51799L5.33309 8.64274Z" fill="white"/>
               </svg>

               Более 15k проектов
             </p>
             <p class="flex items-center gap-2 bg-white/10 font-medium border uppercase border-white/10 backdrop-blur-md px-4 py-2  text-white">
               <svg width="15" height="11" viewBox="0 0 15 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                 <path d="M5.33309 8.64274L12.9934 0.982422L14.1719 2.16093L5.33309 10.9997L0.0297852 5.69649L1.2083 4.51799L5.33309 8.64274Z" fill="white"/>
               </svg>

               Всегда в срок
             </p>
           </div>


         </div>


          <div class="grid grid-cols-1 md:grid-cols-2 w-full">
            <div class="flex flex-col md:flex-row items-end gap-2">

              <a href="#" target="_blank" class="p-button p-component p-button-secondary  !px-4  !py-3 !text-black">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M10.0005 0C15.5233 0 20.0005 4.47715 20.0005 10C20.0005 15.5228 15.5233 20 10.0005 20C8.16661 20 6.44802 19.5064 4.97037 18.6447L0.00466847 20L1.35663 15.0315C0.494448 13.5536 0.000488281 11.8345 0.000488281 10C0.000488281 4.47715 4.47764 0 10.0005 0ZM6.39183 5.30833C6.26244 5.31742 6.13558 5.34902 6.02008 5.40811C5.93343 5.45244 5.85299 5.51651 5.7266 5.63586C5.60725 5.74855 5.53808 5.84697 5.4652 5.94186C5.0955 6.4232 4.8968 7.01405 4.90049 7.62098C4.9025 8.1116 5.02994 8.5884 5.2312 9.0336C5.63933 9.9364 6.31239 10.8908 7.20145 11.7759C7.41501 11.9885 7.62424 12.2034 7.84985 12.402C8.95331 13.3736 10.2683 14.0742 11.6902 14.4482C11.6902 14.4482 12.2502 14.5342 12.2584 14.5347C12.4439 14.5447 12.6291 14.5313 12.8148 14.5218C13.1061 14.5068 13.3905 14.428 13.6479 14.2909C13.8134 14.2028 13.8917 14.159 14.0306 14.0714C14.0306 14.0714 14.0732 14.0426 14.1554 13.9814C14.2904 13.8808 14.3738 13.81 14.4861 13.6934C14.5689 13.6074 14.6401 13.5058 14.6951 13.3913C14.7733 13.2281 14.852 12.9166 14.8833 12.6579C14.9072 12.4603 14.9 12.3523 14.8974 12.2854C14.8931 12.1778 14.8042 12.0671 14.7068 12.0201L14.1253 11.7587C14.1253 11.7587 13.2558 11.3803 12.724 11.1377C12.6686 11.1124 12.608 11.1007 12.5471 11.097C12.4137 11.0888 12.2642 11.1236 12.1691 11.2238C12.1641 11.2218 12.0979 11.279 11.3744 12.1555C11.3345 12.2032 11.241 12.3069 11.0793 12.2972C11.0549 12.2955 11.0306 12.292 11.0069 12.2858C10.9414 12.2685 10.8776 12.2457 10.8152 12.2193C10.6915 12.1668 10.6481 12.1469 10.5636 12.1105C9.98631 11.8583 9.45651 11.5209 8.98821 11.108C8.86261 10.9974 8.74581 10.8783 8.62541 10.7616C8.20521 10.3543 7.8612 9.9211 7.60528 9.4938C7.59131 9.4705 7.56978 9.4368 7.54659 9.3991C7.50472 9.331 7.45854 9.25 7.44406 9.1944C7.40689 9.0473 7.5055 8.9291 7.5055 8.9291C7.5055 8.9291 7.7489 8.663 7.86199 8.5183C7.97079 8.379 8.06471 8.2428 8.12451 8.1457C8.24231 7.95633 8.27961 7.76062 8.21771 7.60963C7.93715 6.92565 7.64769 6.24536 7.34937 5.56894C7.29049 5.43545 7.11536 5.33846 6.9561 5.32007C6.90216 5.31384 6.84826 5.30758 6.7941 5.30402C6.66004 5.29748 6.52571 5.29892 6.39183 5.30833Z" fill="black"/>
                </svg>
                Мы в WhatsApp
              </a>
              <a href="#" target="_blank" class="p-button p-component p-button-info  !px-4 !py-3 !text-white">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M24 12C24 18.6274 18.6274 24 12 24C5.37258 24 0 18.6274 0 12C0 5.37258 5.37258 0 12 0C18.6274 0 24 5.37258 24 12ZM12.4301 8.85895C11.2628 9.34442 8.93016 10.3493 5.43192 11.8734C4.86385 12.0992 4.56629 12.3203 4.53919 12.5363C4.49341 12.9016 4.95073 13.0453 5.5735 13.2412C5.6582 13.2678 5.74598 13.2954 5.83596 13.3247C6.44866 13.5238 7.27285 13.7568 7.70131 13.766C8.08997 13.7744 8.52376 13.6142 9.00266 13.2853C12.2712 11.079 13.9584 9.96384 14.0644 9.93984C14.1391 9.9228 14.2427 9.90156 14.3128 9.96384C14.383 10.0262 14.376 10.1443 14.3687 10.176C14.3233 10.3692 12.5281 12.0382 11.5992 12.9018C11.3221 13.1593 11.0521 13.4224 10.78 13.6847C10.2108 14.2333 9.78396 14.6448 10.8036 15.3168C11.8373 15.998 12.8788 16.6778 13.8869 17.3965C14.384 17.751 14.8308 18.0695 15.3826 18.0187C15.7033 17.9892 16.0345 17.6876 16.2026 16.7884C16.6002 14.6632 17.3816 10.0585 17.5622 8.161C17.5781 7.99476 17.5582 7.782 17.5422 7.6886C17.5262 7.59521 17.4928 7.46213 17.3714 7.36362C17.2276 7.24696 17.0057 7.22236 16.9064 7.22411C16.455 7.23206 15.7626 7.47284 12.4301 8.85895Z" fill="white"/>
                </svg>

                Мы в Telegram
              </a>

            </div>

          </div>
        </div>

      </div>
    </div>

  </section>
  <section class="pb-[60px] md:pb-[120px]">
    <div class="container">
      <p class="font-semibold text-3xl md:text-6xl mb-10">Наш ассортимент</p>
      <Catalog/>
    </div>
  </section>

  <section class="bg-[url(/f_bg.png)] py-[60px] md:py-[120px] text-white bg-no-repeat bg-cover">
    <div class="container">
      <p class="font-semibold text-3xl md:text-6xl mb-10 ">Преимущества продукции</p>
      <div class="grid grid-cols-1 md:grid-cols-4 gap-3">
        <div class=" p-8">
<div class="flex gap-4">
  <div class="">
    <svg width="72" height="72" viewBox="0 0 72 72" fill="none" xmlns="http://www.w3.org/2000/svg">
      <rect width="72" height="72" rx="36" fill="#A3613C"/>
      <path d="M28.5 27.875C28.5 28.7038 29.2902 29.4987 30.6967 30.0847C32.1032 30.6708 34.0109 31 36 31C37.9891 31 39.8968 30.6708 41.3033 30.0847C42.7098 29.4987 43.5 28.7038 43.5 27.875C43.5 27.0462 42.7098 26.2513 41.3033 25.6653C39.8968 25.0792 37.9891 24.75 36 24.75C34.0109 24.75 32.1032 25.0792 30.6967 25.6653C29.2902 26.2513 28.5 27.0462 28.5 27.875Z" stroke="white" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round"/>
      <path d="M43.5 27.875V33.6575C43.8629 33.4932 44.2706 33.4561 44.6572 33.5524C45.0437 33.6486 45.3864 33.8725 45.6298 34.1878C45.8733 34.5031 46.0031 34.8914 45.9984 35.2897C45.9937 35.688 45.8546 36.0731 45.6038 36.3825L45.4825 36.5175L43.5 38.5V43.5C43.5 45.5125 40.325 47.1562 36.3438 47.25H36C31.8575 47.25 28.5 45.5712 28.5 43.5V41L26.5176 39.0175C26.2243 38.7247 26.0433 38.3382 26.0062 37.9255C25.969 37.5128 26.078 37.1001 26.3141 36.7596C26.5502 36.4191 26.8985 36.1724 27.2981 36.0626C27.6976 35.9527 28.123 35.9868 28.5 36.1587V27.875M33.5 36.625V38.5M38.5 41V42.25" stroke="white" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round"/>
    </svg>

  </div>
  <div class="">
    <p class="text-3xl  font-medium mb-4">Прямые поставки от производителя</p>
    <p>Закупаем пиломатериалы напрямую, без посредников — это позволяет держать честные цены и стабильно высокое качество продукции.</p>
  </div>
</div>


        </div>
        <div class=" p-8">
          <div class="mb-16 md:mb-32">
            <div class="flex gap-4">
              <div class="">
                <svg width="73" height="72" viewBox="0 0 73 72" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="0.841553" width="72" height="72" rx="36" fill="#A3613C"/>
                  <path d="M36.8416 46.3125H27.4666C27.2179 46.3125 26.9795 46.2137 26.8036 46.0379C26.6278 45.8621 26.5291 45.6236 26.5291 45.375V36C26.5291 35.7514 26.6278 35.5129 26.8036 35.3371C26.9795 35.1613 27.2179 35.0625 27.4666 35.0625H36.8416M36.8416 46.3125V35.0625M36.8416 46.3125H46.2166C46.4652 46.3125 46.7037 46.2137 46.8795 46.0379C47.0553 45.8621 47.1541 45.6236 47.1541 45.375V36C47.1541 35.7514 47.0553 35.5129 46.8795 35.3371C46.7037 35.1613 46.4652 35.0625 46.2166 35.0625H36.8416M41.5291 36V39.75M37.7791 26.625V30.375M32.1541 36V39.75M30.2791 26.625V35.0625H43.4041V26.625C43.4041 26.3764 43.3053 26.1379 43.1295 25.9621C42.9537 25.7863 42.7152 25.6875 42.4666 25.6875H31.2166C30.9679 25.6875 30.7295 25.7863 30.5536 25.9621C30.3778 26.1379 30.2791 26.3764 30.2791 26.625Z" stroke="white" stroke-width="1.875"/>
                </svg>

              </div>
              <div class="">
                <p class="text-3xl  font-medium mb-4">Широкий ассортимент на складе</p>
                <p>Всегда в наличии популярные позиции: доска обрезная, брус, вагонка, блок-хаус и многое другое. Подберём нужный объём и формат под ваш проект.</p>
              </div>
            </div>



          </div>

        </div>
        <div class=" p-8">
          <div class="mb-16 md:mb-32">
            <div class="flex gap-4">
              <div class="">
                <svg width="73" height="72" viewBox="0 0 73 72" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="0.366455" width="72" height="72" rx="36" fill="#A3613C"/>
                  <path d="M43.8665 44.125C44.904 44.125 45.7415 43.2875 45.7415 42.25C45.7415 41.2125 44.904 40.375 43.8665 40.375C42.829 40.375 41.9915 41.2125 41.9915 42.25C41.9915 43.2875 42.829 44.125 43.8665 44.125ZM45.7415 32.875H42.6165V36H48.1915L45.7415 32.875ZM28.8665 44.125C29.904 44.125 30.7415 43.2875 30.7415 42.25C30.7415 41.2125 29.904 40.375 28.8665 40.375C27.829 40.375 26.9915 41.2125 26.9915 42.25C26.9915 43.2875 27.829 44.125 28.8665 44.125ZM46.3665 31L50.1165 36V42.25H47.6165C47.6165 44.325 45.9415 46 43.8665 46C41.7915 46 40.1165 44.325 40.1165 42.25H32.6165C32.6165 44.325 30.9415 46 28.8665 46C26.7915 46 25.1165 44.325 25.1165 42.25H22.6165V28.5C22.6165 27.1125 23.729 26 25.1165 26H42.6165V31H46.3665ZM25.1165 28.5V39.75H26.0665C26.754 38.9875 27.754 38.5 28.8665 38.5C29.979 38.5 30.979 38.9875 31.6665 39.75H40.1165V28.5H25.1165ZM33.8665 29.75L38.2415 34.125L33.8665 38.5V35.375H27.6165V32.875H33.8665V29.75Z" fill="white"/>
                </svg>

              </div>
              <div class="">
                <p class="text-3xl  font-medium mb-4"> Оперативная доставка</p>
                <p>Быстро организуем доставку по городу и области. Собственный автопарк — вы не ждёте неделями!</p>
              </div>
            </div>



          </div>

        </div>
        <div class=" p-8">
          <div class="mb-16 md:mb-32">
            <div class="flex gap-4">
              <div class="">
                <svg width="73" height="72" viewBox="0 0 73 72" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="0.208008" width="72" height="72" rx="36" fill="#A3613C"/>
                  <path d="M24.0224 31.2288L29.0305 25.795C29.156 25.6614 29.3076 25.5552 29.4761 25.4829C29.6445 25.4106 29.826 25.3739 30.0093 25.375H42.4068C42.59 25.3739 42.7716 25.4106 42.94 25.4829C43.1084 25.5552 43.2601 25.6614 43.3855 25.795L48.3936 31.2288C48.5992 31.4472 48.7119 31.737 48.7078 32.0369C48.7037 32.3369 48.5832 32.6235 48.3718 32.8363L36.6768 46.0938C36.6181 46.1603 36.546 46.2135 36.4652 46.25C36.3843 46.2865 36.2967 46.3054 36.208 46.3054C36.1193 46.3054 36.0317 46.2865 35.9509 46.25C35.87 46.2135 35.7979 46.1603 35.7393 46.0938L24.0443 32.8363C23.8328 32.6235 23.7123 32.3369 23.7082 32.0369C23.7042 31.737 23.8168 31.4472 24.0224 31.2288Z" stroke="white" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round"/>
                  <path d="M31.208 33.5L36.208 39.125L41.208 33.5" stroke="white" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>


              </div>
              <div class="">
                <p class="text-3xl  font-medium mb-4">Индивидуальный подход</p>
                <p>Работаем с частными клиентами и организациями. Помогаем с выбором, предлагаем оптовые скидки, готовы к нестандартным заказам.</p>
              </div>
            </div>


          </div>

        </div>
      </div>
    </div>
  </section>

  <section class="py-[60px] md:py-[120px]">
    <div class="container">
      <div class="flex items-center justify-between mb-10">
        <div class="">
          <p class="font-semibold text-3xl md:text-6xl  ">Наши работы</p>
        </div>

      </div>

      <div class="masonry-grid">

        <img src="~assets/img/XXXL.png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(1).png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(2).png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(3).png" class="w-full" alt="">
        <img src="~assets/img/XXXL%20(4).png" class="w-full" alt="">


      </div>
    </div>
  </section>
  <section class="py-[60px] ">
    <div class="container">
      <p class="font-semibold text-3xl md:text-6xl mb-10 ">Наши услуги</p>
     <Services/>
    </div>
  </section>
  <section class="py-[60px] md:py-[120px]">
    <div class="container">
      <p class="font-semibold text-3xl md:text-6xl mb-10 ">Ответы на частые вопросы</p>

      <div class="grid grid-cols-1 md:grid-cols-2 gap-4">

        <Accordion >
          <AccordionPanel :value="item.id" v-for="item in faq" :key="item.id">
            <AccordionHeader>{{item.question}}</AccordionHeader>
            <AccordionContent>
              <p class="m-0">
                {{item.answer}}
            </p>
            </AccordionContent>
          </AccordionPanel>

        </Accordion>
      </div>
    </div>
  </section>

</template>

<style>
.masonry-grid {
  column-count: 3; /* Количество колонок */
  column-gap: 1rem; /* Расстояние между колонками */
}
.masonry-grid img {
  display: block;
  width: 100%;
  margin-bottom: 1rem; /* Расстояние между изображениями */
}
</style>